app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
---
  def show
    @note = Note.find(params[:id])