app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "note", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "A note"], ["note", "Important notes"], ["created_at", 2016-07-14 17:20:43 UTC], ["updated_at", 2016-07-14 17:20:43 UTC], ["user_id", 283]]
---
  def create
    Note.create(note_params)